# 1
'''Что больше или равно числа 17925: (34**2)  (26*3)  (17*33)  (4394*4)'''

# a = 17925
# b = 34**2
# print(b)
# c = 26*3
# print(c)
# d = 17*33
# print(d)
# e = 4394*4
# print(e)

# otvet: ni odin ne bol'she

# 2
'''
Создайте 4 условия:
1.Число А больше В но меньше С.
2. Результат деления по модулю числа 7 на 3 умножить на 4.8
3.Создать два разных выражения которые равны друг другу.
4. Создать 2 выражения которые  НЕ равны друг другу.
'''

# a = 30
# b = 20
# c = 25
# e = 30
# number_one = a>b<c
# print(number_one)
# d = 7//3*4.8
# print(d)
# if a == e:
#     print('yes')
#
# if b != e:
#     print('no')

# 3
'''
Составить выражение:
Сложить 2 любых числа
Умножить их на любое число
Возвести в квадрат
Отнять от всего результат: 193432
'''
# a = int(input())
# b = int(input())
# slojenie = a + b
# kvadrat = a**b
# print(slojenie)
# c = 200
# print (slojenie*c)
# print(kvadrat)
# print(kvadrat/193432)

# 4
'''
Что больше:
(17*3)  (12*5)
(12**3) (13*7)
(4**5) 
 (512+5)'''
# a = 17*3
# b = 12*5
# c = 12**3
# d = 13*7
# e = 4**5
# f = 512+5
# print(a,b,c,d,e,f)

# 5
''' Чему равен пример 
-21//10
Почему именно этот ответ?
'''

# a = -21//10
# print(a)

# potomu chto okruglyayet

# 6
'''
Найдите, какой процент этого столетия мы прожили:
формула расчета процентов
(a/b)*100
где a-прожитые года
b-сколько нужно(тк. это столетие, 
b-100)
'''
# a = int(input('прожитые года: '))
# b = int(input('сколько нужно: '))
# procent_stoletiya = (a/b)*100
# print(f'{procent_stoletiya} процент этого столетия вы прожили ')

# 7
'''
Создать 2 переменные.
В первой год вашего рождения, Во второй 
2020 год 
посчитайте сколько лет вам должно быть через 2 года/и сколько лет вам было два года назад
'''

# a = int(input('год вашего рождения: '))
# b = int(input('этот год: '))
# c = (b - a) + 2
# d = (b - a) - 2
# print(f'через 2 года вам будет: {c}')
# print(f'2 года назад вам было: {d}')

# 8
'''Найдите средне арифмитическое чисел:25, 75, 10, 95. '''

# a = 25 + 75 + 10 + 95
# print(a/4)

# 9
''' 
Создать 3 переменные в которых лежат 3 одинаковых числа с плавающей точкой. Первые 2 переменные между собой сложить и умножить на 3 переменную.
'''

# a = 23.4
# b = 27897.34
# c = 234.67
# print((a+b)*c)

# 10
'''
Создать 5 переменных:
a.Чётное число
b.Любое от 5 до 15
c.Дробное число до 20
d.Любое нечётное число
e.Любое число
'''
# a = 24
# b = 14
# c = 10.3
# d = 23
# e = 456

# 11
'''
Из Задания 3:
Составить выражение:
(a-e**(b/d))%c'''

# a = 24
# b = 14
# c = 10.3
# d = 23
# e = 456
# print((a-e**(b/d))%c)





